#+TITLE: graduate school application
#+DATE: <2016-08-15 Mon>
#+AUTHOR: Jiaxuan Wang
#+EMAIL: jiaxuan@umich
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t c:nil
#+OPTIONS: creator:comment d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t
#+OPTIONS: num:t p:nil pri:nil stat:t tags:t tasks:t tex:t timestamp:t toc:t
#+OPTIONS: todo:t |:t
#+CREATOR: Emacs 24.5.1 (Org mode 8.2.10)
#+DESCRIPTION:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export

* lisp playground
  #+BEGIN_SRC lisp
    (flet ((f1 (x) (1+ x))
           (f2 (x) (1- x)))
      (f2 (f1 10))
      )
    (labels ((fac (n)
               (if (= n 1) 1
                   (* n (fac (1- n))))
               ))
      (fac 11))
  #+END_SRC

  #+RESULTS:
  : 39916800
  
  #+BEGIN_SRC lisp
    ;; let's write a database that maintains school's information
    (defvar *db* NIL)

    (defun add (uname program deadline gre toefl n-statement-of-purpose n-reference-letter)
      (push (list :uname uname :program program :deadline deadline :reqGRE gre :reqToefl toefl
                  :n-statement-of-purpose n-statement-of-purpose :n-reference-letter n-reference-letter) *db*))

    (defun dump () (dolist (school *db*) (format t "~{~a:~30t~a~%~}~%" school)))

    (defun clear () (setf *db* nil))

    (defun save (fn) (with-open-file (out fn
                                      :direction :output
                                      :if-exists :supersede)
                       (with-standard-io-syntax (print *db* out))))

    (defun load (fn) (with-open-file (in fn)
                       (with-standard-io-syntax (setf *db* (read in)))))

    (clear)
  #+END_SRC

  #+RESULTS:
  : NIL

  #+BEGIN_SRC lisp :results output
    ;; basic facts
    (add 'Stanford 'computer-science-phd '12-06-2016 t nil 1 3)
    (add 'MIT 'eecs-phd '12-15-2016 nil nil 1 3)
    (add 'UCBerkeley 'computer-science-ms-phd '12-15-2016 t nil 2 3)
    (add 'CMU 'machine-learning-phd '12-01-2016 t t 1 3)
    (add 'Princeton 'computer-science-phd '12-15-2016 t nil 1 3)
    (dump)
  #+END_SRC

  #+RESULTS:
  #+begin_example
  UNAME:                        PRINCETON
  PROGRAM:                      COMPUTER-SCIENCE-PHD
  DEADLINE:                     12-15-2016
  REQGRE:                       T
  REQTOEFL:                     NIL
  N-STATEMENT-OF-PURPOSE:       1
  N-REFERENCE-LETTER:           3

  UNAME:                        CMU
  PROGRAM:                      MACHINE-LEARNING-PHD
  DEADLINE:                     12-01-2016
  REQGRE:                       T
  REQTOEFL:                     T
  N-STATEMENT-OF-PURPOSE:       1
  N-REFERENCE-LETTER:           3

  UNAME:                        UCBERKELEY
  PROGRAM:                      COMPUTER-SCIENCE-MS-PHD
  DEADLINE:                     12-15-2016
  REQGRE:                       T
  REQTOEFL:                     NIL
  N-STATEMENT-OF-PURPOSE:       2
  N-REFERENCE-LETTER:           3

  UNAME:                        MIT
  PROGRAM:                      EECS-PHD
  DEADLINE:                     12-15-2016
  REQGRE:                       NIL
  REQTOEFL:                     NIL
  N-STATEMENT-OF-PURPOSE:       1
  N-REFERENCE-LETTER:           3

  UNAME:                        STANFORD
  PROGRAM:                      COMPUTER-SCIENCE-PHD
  DEADLINE:                     12-06-2016
  REQGRE:                       T
  REQTOEFL:                     NIL
  N-STATEMENT-OF-PURPOSE:       1
  N-REFERENCE-LETTER:           3

  #+end_example

